routes/web.php

    }
});

Route::get('posts', function(){

    $posts = Post::all();
    return view('post.post', compact('posts'));
});
---
select * from `posts`

Route::get('/auth/callback', function(){
    $user = Socialite::driver('github')->user();

    $user = User::firstOrCreate([
        'email' => $user->email
    ],[
        'name' => $user->name,
        'password' => bcrypt(Str::random(24))
    ]);
---
insert into `users` (`email`, `name`, `password`, `updated_at`, `created_at`) values ('sakilhossain01969@gmail.com', 'Shakil Ahmed', '$2y$10$Gk5s/vHoW0i1SeDqKjmTZOm.L/H177devUBDiBkqra6CHB7aCajJu', '2023-01-23 04:53:39', '2023-01-23 04:53:39')
select * from `users` where (`email` = 'sakilhossain01969@gmail.com') limit 1